Repository: reporter123/kio-locate
Catalog: po/*.po
Languages: cs, de

source: <h1>"%1" could not be started.</h1><p>Please note that kio-locate can't be used on its own. You need an additional program for doing searches. Typically this is the command line tool <i>locate</i> that can be found in many distributions by default. You can check if the correct tool is used by looking at the <a href="locater:config">setting</a> "Locate Binary".</p><p>Besides the mentioned tool <i>locate</i>, kio-locate can use any tool that uses the same syntax. In particular, it was reported to work with <i>slocate</i> and <i>rlocate</i></p>.
de: <h1>"%1" konnte nicht gestartet werden.</h1><p>Bitte beachten Sie, dass kio-locate nicht alleine verwendet werden kann. Sie benötigen ein zusätzliches Programm, um die Suche durchzuführen. Üblicherweise ist dies das Kommandozeilenprogramm <i>locate</i>, das invielen Distributionen bereits vorinstalliert ist. Sie können prüfen, ob das richtige Programm verwendet wird, indem Sie sich die <a href="locater:config">Einstellung</a>"Locate Backend" ansehen.</p><p>Ausser dem erwähnten Programm <i>locate</i> kann kio-locate auch jedes andere Programm verwenden, das die gleiche Syntax benutzt. Insbesondere wurde gemeldet, dass es auch mit <i>slocate</i> und <i>rlocate</i> funktioniert.</p>

source: Locating %1 ...
cs: Hledání %1 ...
de: Suche %1 ...

# Locate processing finished.
source: Finished.
de: Suche abgeschlossen.

source: Configure - kio-locate
cs: Nastavení - kio-locate
de: Einstellungen - kio-locate

# General settings
source: General
de: Allgemeines

# Filter settings
source: Filters
de: Filter

source: Configuration successfully updated.
cs: Nastavení bylo úspěšně převzato.
de: Einstellungen wurden übernommen.

source: Configuration unchanged.
cs: Nastavení nezměněno.
de: Einstellungen unverändert.

source: Case sensitivity
cs: Psaní velkých a malých písmen
de: Groß- und Kleinschreibung

source: Collapse directory
cs: Složit adresář
de: Treffer zusammenfassen

source: How to display a collapsed directory entry
cs: Jak zobrazit složený adresářový záznam
de: Anzeige zusammengefasster Treffer

source: Icon to use for a collapsed directory entry
cs: Ikona pro složený adresářový záznam
de: Icon für zusammengefasste Treffer

source: White list
cs: Bílá listina
de: Weiße Liste

source: Black list
cs: Černá listina
de: Schwarze Liste

source: Locate Binary
cs: Jádro locate
de: Locate Backend

source: Additional Arguments for locate
cs: Dodatečné argumenty pro locate
de: Zusätzliche Argumente für locate

source: Filter Settings
cs: Nastavení filtru
de: Filtereinstellungen

source: A path must match at least one of the regular expressions in the White List and it must not match any of the expressions in the Black List for being displayed as a hit.
cs: Cesta, aby se zobrazila jako nález, musí odpovídat alespoň jednomu regulárnímu výrazu nacházejícímu se na bílé listině a nesmí odpovídat žádnému regulárnímu výrazu nacházejícímu se na černé listině.
de: Damit ein Pfad als Treffer angezeigt wird, muss er mit mindestens einem regulären Ausdruck aus der Weißen Liste übereinstimmen und darf mit keinem Eintrag aus der Schwarzen Liste übereinstimmen.

source: A path must match at least one of these regular expressions.
cs: Cesta musí odpovídat alespoň jednomu z těchto regulárních výrazů.
de: Pfade müssen mit mindestens einem dieser regulären Ausdrücke übereinstimmen.

source: White List
cs: Bílá listina
de: Weiße Liste

source: A path must not match any of these regular expressions.
cs: Cesta nesmí odpovídat žádnému z těchto regulárních výrazů.
de: Pfade dürfen mit keinem dieser regulären Ausdrücke übereinstimmen.

source: Black List
cs: Černá listina
de: Schwarze Liste

source: <i>Hint:</i> E.g. replacing the default '.' entry by '^/home/user/' will only allow hits in the home directory of user.
cs: <i>Rada:</i> Můžete kupříkladu nahradit výchozí zápis '.' pomocí '^/home/user/', aby se ukazovaly pouze nálezy v domácím adresáři uživatele.
de: <i>Tipp:</i> Sie können z.B. den standardmäßigen Eintrag '.' durch '^/home/user/' ersetzen, um nur noch Treffer im persönlichen Ordner von user anzuzeigen.

source: Locate Settings
cs: Nastavení pro Locate
de: Einstellungen für Locate

source: <p>kio-locate does not handle the settings of locate, because this setup varies among different distributions. There are even distributions that use replacements like slocate.</p> <p>To configure locate you should take a look at the manpage of locate. Since most distributions use cron for updating locate's database, it may also be useful to take a look at the manpage of crontab.</p>
cs: <p>Nastavení z locate nemůžete převzít do kio-locate, protože mezi jednotlivými distribucemi jsou velké rozdíly. Některé dokonce používají jiný program nahrazující locate, jako je například slocate.</p> <p>Pro nastavení locate se vyplatí podívat se na manuálové stránky k locate. Jelikož většina distribucí k aktualizaci databáze locate používá cron, vyplatí se také podívat se na manuálové stránky k crontab a přečíst si je.</p>
de: <p>Sie können die Einstellungen von locate nicht mit kio-locate vornehmen, da es dabei große Unterschiede zwischen verschiedenen Distributionen gibt. Einige verwenden sogar ganz andere Ersatzprogramme.</p> <p>Für die Einstellungen von locate lohnt es sich einen Blick in die Manpage zu locate zu werfen. Da die meisten Distributionen cron zur Aktualisierung der Datenbank für locate verwenden, kann es sich auch lohnen die Manpage zu crontab zu lesen.</p>

source: Use these settings only if you really know what you do. Otherwise the default should be ok.
cs: Tato nastavení použijte jen tehdy, když přesně víte, co děláte. V opačném případě by předlohy s výchozím nastavením měly postačovat.
de: Verwenden Sie die folgenden Einstellung nur wenn Sie genau wissen, was Sie tun. Ansonsten sollten die Vorgaben genügen.

source: Locate &binary:
cs: &Cesta k locate:
de: &Pfad zu locate:

source: <i>Hint:</i> If you don't specify a value here (which is the default), kio-locate will automatically pick slocate, rlocate or locate (in that order).
de: <i>Tipp:</i> Wenn Sie dieses Feld leer lassen (was die Voreinstellung ist), dann probiert kio-locate nacheinander slocate, rlocate und locate (in dieser Reihenfolge).

source: Additional &arguments:
cs: Dodatečné &argumente:
de: Zusätzliche &Argumente:

source: Do not use -r or -i here. The first will confuse kio-locate, while the latter can be changed through the caseSensitivity option.
cs: Zde nepoužívejte -r nebo -i. První poplete kio-locate a poslední lze nastavit pomocí volby "Psaní velkých a malých písmen".
de: Verwenden Sie hier nicht -r oder -i. Ersteres verwirrt kio-locate und letzteres kann durch die Option "Groß- und Kleinschreibung" eingestellt werden.

source: <i>Hint:</i> Do not use -r or -i here. The first will confuse kio-locate, and the latter can be changed through the "Case sensitivity" option.
cs: <i>Rada:</i> Zde nepoužívejte -r nebo -i. První poplete kio-locate a poslední lze nastavit pomocí volby "Psaní velkých a malých písmen".
de: <i>Tipp:</i> Verwenden Sie nicht -r oder -i. Ersteres verwirrt kio-locate und letzteres kann durch die Option "Groß- und Kleinschreibung" eingestellt werden.

source: General Settings
cs: Obecná nastavení
de: Allgemeine Einstellungen

source: Case se&nsitivity:
cs: &Psaní velkých a malých písmen
de: &Groß- und Kleinschreibung

source: "Auto" for automatic case sensitivity determination (lowercase pattern -> case insensitive, upper or mixedcase pattern -> case sensitive), "Sensitive" for case sensitive and "Insensitive" for case insensitive.
de: "Auto" für automatische Erkennung (Kleinschreibung -> Ignorieren, Großschreibung oder gemischte Groß-/Kleinschreibung -> Beachten), "Beachten" oder "Ignorieren".

# Case-sensitive search
source: Sensitive
de: Beachten

# Case-insensitive search
source: Insensitive
de: Ignorieren

source: <i>Hint:</i> With "Auto" case sensitivity a pattern will be case insensitive if it is lowercase and case sensitive if it is mixed or uppercase.
cs: Když zvolíte "Automaticky" bude hledání rozlišovat psaní velkých a malých písmen jen tehdy, když nejsou všude napsána písmena malá.
de: <i>Tipp:</i> Wenn Sie "Auto" auswählen wird eine Suche Groß- und Kleinschreibung nur dann unterscheiden, falls Sie nicht durchgehend klein geschrieben ist.

source: Collapsing Search Results
cs: Složit výsledky hledání
de: Treffer zusammenfassen

source: &Collapse a directory with more hits:
cs: &Složit adresáře s více nálezy:
de: Verzeichnisse mit mehr Treffern &zusammenfassen:

source: Collapse a directory with more hits.
cs: Složit adresáře s více nálezy.
de: Verzeichnisse mit mehr Treffern zusammenfassen.

source: Text of a collapsed &directory:
cs: Ukazatel složeného &adresářového hledání:
de: Anzeige &zusammengefasster Treffer:

source: Hint: %1 is substituted by the number of hits, %2 by the name of the directory.
cs: Rada: %1 je nahrazeno počtem nálezů a %2 názvem adresáře.
de: Tipp: %1 wird durch die Anzahl der Treffer und %2 durch den Verzeichnisnamen ersetzt.

source: <i>Hint:</i> %1 is substituted by the number of hits and %2 by the name of the directory.
cs: <i>Rada:</i> %1 je nahrazeno počtem nálezů a %2 názvem adresáře.
de: <i>Tipp:</i> %1 wird durch die Anzahl der Treffer und %2 durch den Verzeichnisnamen ersetzt.

source: &Icon of a collapsed directory:
cs: &Ikona pro složené adresářové hledání:
de: &Icon für zusammengefasste Treffer:

# Folder icon color
source: Blue
de: Blau

# Folder icon color
source: Green
de: Grün

# Folder icon color
source: Grey
de: Grau

# Folder icon color
source: Red
de: Rot

# Folder icon color
source: Violet
de: Violett

# Folder icon color
source: Yellow
de: Gelb
